app/views/zombies/index.html.erb

  <tbody>
  <% Zombie.all.each do |zombie| %>
---
SELECT "zombies".* FROM "zombies"