app/controllers/zombies_controller.rb

  def show
    @zombie = Zombie.find(params[:id])
---
SELECT  "zombies".* FROM "zombies"  WHERE "zombies"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @zombie = Zombie.create(name: params[:name], home: params[:home])
---
INSERT INTO "zombies" ("home", "name") VALUES (?, ?)  [["home", "321"], ["name", "123"]]

  def destroy
    @zombie = Zombie.find(params[:id])
    @zombie.destroy
---
SELECT  "zombies".* FROM "zombies"  WHERE "zombies"."id" = ? LIMIT 1  [["id", 17]]
DELETE FROM "zombies" WHERE "zombies"."id" = ?  [["id", 17]]